nxp-mcuxpresso/mcux-sdk/boards/frdmk28fa/project_template/pin_mux.h
/*
 * Copyright 2018-2019 NXP.
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#define PORT_DFER_DFE_0_MASK 0x01u /*!<@brief Digital Filter Enable Mask for item 0. */

/*! @name PORTA4 (coord L9), SW2
  @{ */
#define BOARD_SW2_GPIO GPIOA /*!<@brief GPIO device name: GPIOA */
#define BOARD_SW2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SW2_PIN 4U     /*!<@brief PORTA pin index: 4 */
                             /* @} */

/*! @name PORTD0 (coord A6), SW3
  @{ */
#define BOARD_SW3_GPIO GPIOD /*!<@brief GPIO device name: GPIOD */
#define BOARD_SW3_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SW3_PIN 0U     /*!<@brief PORTD pin index: 0 */
                             /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitButtonsPins(void);

/*! @name PORTA18 (coord N13), Y2[1]/EXTAL
  @{ */
#define BOARD_EXTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_EXTAL0_PIN 18U    /*!<@brief PORTA pin index: 18 */
                                /* @} */

/*! @name PORTA19 (coord M13), Y2[3]/XTAL
  @{ */
#define BOARD_XTAL0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_XTAL0_PIN 19U    /*!<@brief PORTA pin index: 19 */
                               /* @} */

/*! @name XTAL32 (coord N5), Y1[1]/XTAL32_RTC
  @{ */
/* @} */

/*! @name EXTAL32 (coord N6), Y1[2]/EXTAL32_RTC
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitOSCPins(void);

/*! @name PORTE6 (coord E2), J1[7]/D1[1]/LEDRGB_RED
  @{ */
#define BOARD_LED_RED_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_RED_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_RED_PIN 6U     /*!<@brief PORTE pin index: 6 */
                                 /* @} */

/*! @name PORTE7 (coord E3), J1[15]/D1[4]/LEDRGB_GREEN
  @{ */
#define BOARD_LED_GREEN_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_GREEN_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_GREEN_PIN 7U     /*!<@brief PORTE pin index: 7 */
                                   /* @} */

/*! @name PORTE8 (coord E4), J1[13]/D1[3]/LEDRGB_BLUE
  @{ */
#define BOARD_LED_BLUE_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_LED_BLUE_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_LED_BLUE_PIN 8U     /*!<@brief PORTE pin index: 8 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitLEDsPins(void);

#define SOPT5_LPUART0RXSRC_LPUART_RX 0x00u /*!<@brief LPUART0 receive data source select: LPUART0_RX pin */
#define SOPT5_LPUART0TXSRC_LPUART_TX 0x00u /*!<@brief LPUART0 transmit data source select: LPUART0_TX pin */

/*! @name PORTC24 (coord B7), LPUART0_TX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_TX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_TX_PIN 24U    /*!<@brief PORTC pin index: 24 */
                                       /* @} */

/*! @name PORTC25 (coord A7), LPUART0_RX_TGTMCU
  @{ */
#define BOARD_DEBUG_UART_RX_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_DEBUG_UART_RX_PIN 25U    /*!<@brief PORTC pin index: 25 */
                                       /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitDEBUG_UARTPins(void);

/*! @name PORTC29 (coord B6), U6[4]/I2C_SCL
  @{ */
#define BOARD_I2C_SCL_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_I2C_SCL_PIN 29U    /*!<@brief PORTC pin index: 29 */
                                 /* @} */

/*! @name PORTC28 (coord C6), U6[6]/I2C SDA
  @{ */
#define BOARD_I2C_SDA_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_I2C_SDA_PIN 28U    /*!<@brief PORTC pin index: 28 */
                                 /* @} */

/*! @name PORTC26 (coord E6), U6[11]/INT1_FXOS8700CQ_R
  @{ */
#define BOARD_ACCEL_INT1_GPIO GPIOC /*!<@brief GPIO device name: GPIOC */
#define BOARD_ACCEL_INT1_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_ACCEL_INT1_PIN 26U    /*!<@brief PORTC pin index: 26 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void);

/*! @name PORTE2 (coord C1), U11[5]/QSPIA_DATA0
  @{ */
#define BOARD_QSPIA_DATA0_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA0_PIN 2U     /*!<@brief PORTE pin index: 2 */
                                     /* @} */

/*! @name PORTE4 (coord E1), U11[2]/QSPIA_DATA1
  @{ */
#define BOARD_QSPIA_DATA1_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA1_PIN 4U     /*!<@brief PORTE pin index: 4 */
                                     /* @} */

/*! @name PORTE3 (coord D1), U11[3]/QSPIA_DATA2
  @{ */
#define BOARD_QSPIA_DATA2_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA2_PIN 3U     /*!<@brief PORTE pin index: 3 */
                                     /* @} */

/*! @name PORTE0 (coord A1), U11[7]/QSPIA_DATA3
  @{ */
#define BOARD_QSPIA_DATA3_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_DATA3_PIN 0U     /*!<@brief PORTE pin index: 0 */
                                     /* @} */

/*! @name PORTE1 (coord B1), U11[6]/QSPIA_SCLK
  @{ */
#define BOARD_QSPIA_SCLK_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SCLK_PIN 1U     /*!<@brief PORTE pin index: 1 */
                                    /* @} */

/*! @name PORTE5 (coord D2), U11[1]/QSPIA_SS
  @{ */
#define BOARD_QSPIA_SS_PORT PORTE /*!<@brief PORT device name: PORTE */
#define BOARD_QSPIA_SS_PIN 5U     /*!<@brief PORTE pin index: 5 */
                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitQSPI_FLASHPins(void);

/*! @name USB1_DM (coord H1), J24[2]USB_CONN_DN
  @{ */
/* @} */

