nxp-mcuxpresso/mcux-sdk/boards/frdmk28fa/project_template/pin_mux.h
/*! @name USB1_DP (coord J1), J24[3]USB_CONN_DP
  @{ */
/* @} */

/*! @name USB1_VBUS (coord J2), J24[1]P5V0_USB_CONN_VBUS
  @{ */
/* @} */

/*! @name PORTA11 (coord M11), J24[4]TC_USB_ID
  @{ */
#define BOARD_USB_ID_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB_ID_PIN 11U    /*!<@brief PORTA pin index: 11 */
                                /* @} */

/*! @name PORTA22 (coord K8), J27[7]/FXIO0_D6/PCLK
  @{ */
#define BOARD_USB0_CLKIN_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_USB0_CLKIN_PIN 22U    /*!<@brief PORTA pin index: 22 */
                                    /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void);

/*! @name PORTA29 (coord H11), J19[P1]/SDHC0_D2
  @{ */
#define BOARD_SDHC0_D2_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D2_PIN 29U    /*!<@brief PORTA pin index: 29 */
                                  /* @} */

/*! @name PORTA28 (coord H12), J19[P2]/SDHC0_D3
  @{ */
#define BOARD_SDHC0_D3_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D3_PIN 28U    /*!<@brief PORTA pin index: 28 */
                                  /* @} */

/*! @name PORTA25 (coord J11), J19[P7]/SDHC0_D0
  @{ */
#define BOARD_SDHC0_D0_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D0_PIN 25U    /*!<@brief PORTA pin index: 25 */
                                  /* @} */

/*! @name PORTA24 (coord K11), J19[P8]/SDHC0_D1
  @{ */
#define BOARD_SDHC0_D1_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_D1_PIN 24U    /*!<@brief PORTA pin index: 24 */
                                  /* @} */

/*! @name PORTA26 (coord J10), J19[P5]/SDHC0_DCLK
  @{ */
#define BOARD_SDHC0_DCLK_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_DCLK_PIN 26U    /*!<@brief PORTA pin index: 26 */
                                    /* @} */

/*! @name PORTA27 (coord H13), J19[P3]/SDHC0_CMD
  @{ */
#define BOARD_SDHC0_CMD_PORT PORTA /*!<@brief PORT device name: PORTA */
#define BOARD_SDHC0_CMD_PIN 27U    /*!<@brief PORTA pin index: 27 */
                                   /* @} */

/*! @name PORTB5 (coord F13), J19[G1]/SD_CARD_DETECT
  @{ */
#define BOARD_SDCARD_CARD_DETECTION_GPIO GPIOB /*!<@brief GPIO device name: GPIOB */
#define BOARD_SDCARD_CARD_DETECTION_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDCARD_CARD_DETECTION_PIN 5U     /*!<@brief PORTB pin index: 5 */
                                               /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDHC0Pins(void);

/*! @name ADC0_SE16 (coord N4), Q5[2]/LIGHT_SENSOR
  @{ */
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_Init_visible_lightPins(void);

#define PORT_DFER_DFE_2_MASK 0x04u /*!<@brief Digital Filter Enable Mask for item 2. */
#define PORT_DFER_DFE_3_MASK 0x08u /*!<@brief Digital Filter Enable Mask for item 3. */
#define PORT_DFER_DFE_4_MASK 0x10u /*!<@brief Digital Filter Enable Mask for item 4. */
#define PORT_DFER_DFE_5_MASK 0x20u /*!<@brief Digital Filter Enable Mask for item 5. */
#define PORT_DFER_DFE_7_MASK 0x80u /*!<@brief Digital Filter Enable Mask for item 7. */

/*! @name PORTC7 (coord B10), U13[H7]/SDRAM_A16
  @{ */
#define BOARD_SDRAM_A16_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A16_PIN 7U     /*!<@brief PORTC pin index: 7 */
                                   /* @} */

/*! @name PORTC8 (coord C10), U13[H8]/SDRAM_A15
  @{ */
#define BOARD_SDRAM_A15_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A15_PIN 8U     /*!<@brief PORTC pin index: 8 */
                                   /* @} */

/*! @name PORTC9 (coord C9), U13[J8]/SDRAM_A14
  @{ */
#define BOARD_SDRAM_A14_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A14_PIN 9U     /*!<@brief PORTC pin index: 9 */
                                   /* @} */

/*! @name PORTC10 (coord A8), U13[J7]/SDRAM_A13
  @{ */
#define BOARD_SDRAM_A13_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A13_PIN 10U    /*!<@brief PORTC pin index: 10 */
                                   /* @} */

/*! @name PORTD2 (coord A4), U13[J3]/SDRAM_A12
  @{ */
#define BOARD_SDRAM_A12_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A12_PIN 2U     /*!<@brief PORTD pin index: 2 */
                                   /* @} */

/*! @name PORTD3 (coord B4), U13[J2]/SDRAM_A11
  @{ */
#define BOARD_SDRAM_A11_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A11_PIN 3U     /*!<@brief PORTD pin index: 3 */
                                   /* @} */

/*! @name PORTD4 (coord B5), U13[H3]/SDRAM_A10
  @{ */
#define BOARD_SDRAM_A10_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A10_PIN 4U     /*!<@brief PORTD pin index: 4 */
                                   /* @} */

/*! @name PORTD5 (coord C4), U13[H2]/SDRAM_A9
  @{ */
#define BOARD_SDRAM_A9_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_A9_PIN 5U     /*!<@brief PORTD pin index: 5 */
                                  /* @} */

/*! @name PORTC5 (coord A11), U13[H1]/SDRAM_A18
  @{ */
#define BOARD_SDRAM_A18_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A18_PIN 5U     /*!<@brief PORTC pin index: 5 */
                                   /* @} */

/*! @name PORTC4 (coord B11), U13[G3]/SDRAM_A19
  @{ */
#define BOARD_SDRAM_A19_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A19_PIN 4U     /*!<@brief PORTC pin index: 4 */
                                   /* @} */

/*! @name PORTC2 (coord A13), U13[H9]/SDRAM_A20
  @{ */
#define BOARD_SDRAM_A20_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A20_PIN 2U     /*!<@brief PORTC pin index: 2 */
                                   /* @} */

/*! @name PORTC1 (coord B12), U13[G2]/SDRAM_A21
  @{ */
#define BOARD_SDRAM_A21_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A21_PIN 1U     /*!<@brief PORTC pin index: 1 */
                                   /* @} */

