nxp-mcuxpresso/mcux-sdk/boards/frdmk28fa/project_template/pin_mux.h
/*! @name PORTC0 (coord B13), U13[G7]/SDRAM_A22
  @{ */
#define BOARD_SDRAM_A22_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_A22_PIN 0U     /*!<@brief PORTC pin index: 0 */
                                   /* @} */

/*! @name PORTB18 (coord D12), U13[G8]/SDRAM_A23
  @{ */
#define BOARD_SDRAM_A23_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_A23_PIN 18U    /*!<@brief PORTB pin index: 18 */
                                   /* @} */

/*! @name PORTB1 (coord G12), U13[F8]/SDRAM_RAS_b
  @{ */
#define BOARD_SDRAM_RAS_b_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_RAS_b_PIN 1U     /*!<@brief PORTB pin index: 1 */
                                     /* @} */

/*! @name PORTB0 (coord G13), U13[F7]/SDRAM_CAS_b
  @{ */
#define BOARD_SDRAM_CAS_b_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_CAS_b_PIN 0U     /*!<@brief PORTB pin index: 0 */
                                     /* @} */

/*! @name PORTB2 (coord G11), U13[F9]/SDRAM_WE_b
  @{ */
#define BOARD_SDRAM_WE_b_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_WE_b_PIN 2U     /*!<@brief PORTB pin index: 2 */
                                    /* @} */

/*! @name PORTB3 (coord G10), U13[G9]/SDRAM_CS0_b
  @{ */
#define BOARD_SDRAM_CS0_b_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_CS0_b_PIN 3U     /*!<@brief PORTB pin index: 3 */
                                     /* @} */

/*! @name PORTC17 (coord E7), U13[F1]/SDRAM_DQM3
  @{ */
#define BOARD_SDRAM_DQM3_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM3_PIN 17U    /*!<@brief PORTC pin index: 17 */
                                    /* @} */

/*! @name PORTC16 (coord E8), U13[E8]/SDRAM_DQM2
  @{ */
#define BOARD_SDRAM_DQM2_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_DQM2_PIN 16U    /*!<@brief PORTC pin index: 16 */
                                    /* @} */

/*! @name PORTC3 (coord A12), U13[F2]/CLKOUT
  @{ */
#define BOARD_CLKOUT_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_CLKOUT_PIN 3U     /*!<@brief PORTC pin index: 3 */
                                /* @} */

/*! @name PORTD7 (coord E5), U13[F3]/SDRAM_CKE
  @{ */
#define BOARD_SDRAM_CKE_PORT PORTD /*!<@brief PORT device name: PORTD */
#define BOARD_SDRAM_CKE_PIN 7U     /*!<@brief PORTD pin index: 7 */
                                   /* @} */

/*! @name PORTB20 (coord D10), U13[A2]/SDRAM_D31
  @{ */
#define BOARD_SDRAM_D31_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D31_PIN 20U    /*!<@brief PORTB pin index: 20 */
                                   /* @} */

/*! @name PORTB21 (coord D9), U13[B1]/SDRAM_D30
  @{ */
#define BOARD_SDRAM_D30_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D30_PIN 21U    /*!<@brief PORTB pin index: 21 */
                                   /* @} */

/*! @name PORTB17 (coord D13), U13[A8]/SDRAM_D16
  @{ */
#define BOARD_SDRAM_D16_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D16_PIN 17U    /*!<@brief PORTB pin index: 17 */
                                   /* @} */

/*! @name PORTB16 (coord F8), U13[B9]/SDRAM_D17
  @{ */
#define BOARD_SDRAM_D17_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D17_PIN 16U    /*!<@brief PORTB pin index: 16 */
                                   /* @} */

/*! @name PORTB11 (coord E13), U13[B8]/SDRAM_D18
  @{ */
#define BOARD_SDRAM_D18_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D18_PIN 11U    /*!<@brief PORTB pin index: 11 */
                                   /* @} */

/*! @name PORTB10 (coord G9), U13[C9]/SDRAM_D19
  @{ */
#define BOARD_SDRAM_D19_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D19_PIN 10U    /*!<@brief PORTB pin index: 10 */
                                   /* @} */

/*! @name PORTB9 (coord F9), U13[C8]/SDRAM_D20
  @{ */
#define BOARD_SDRAM_D20_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D20_PIN 9U     /*!<@brief PORTB pin index: 9 */
                                   /* @} */

/*! @name PORTB8 (coord F10), U13[D9]/SDRAM_D21
  @{ */
#define BOARD_SDRAM_D21_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D21_PIN 8U     /*!<@brief PORTB pin index: 8 */
                                   /* @} */

/*! @name PORTB7 (coord F11), U13[D8]/SDRAM_D22
  @{ */
#define BOARD_SDRAM_D22_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D22_PIN 7U     /*!<@brief PORTB pin index: 7 */
                                   /* @} */

/*! @name PORTB6 (coord F12), U13[E9]/SDRAM_D23
  @{ */
#define BOARD_SDRAM_D23_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D23_PIN 6U     /*!<@brief PORTB pin index: 6 */
                                   /* @} */

/*! @name PORTC15 (coord D8), U13[E1]/SDRAM_D24
  @{ */
#define BOARD_SDRAM_D24_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D24_PIN 15U    /*!<@brief PORTC pin index: 15 */
                                   /* @} */

/*! @name PORTC14 (coord C8), U13[D2]/SDRAM_D25
  @{ */
#define BOARD_SDRAM_D25_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D25_PIN 14U    /*!<@brief PORTC pin index: 14 */
                                   /* @} */

/*! @name PORTC13 (coord B8), U13[D1]/SDRAM_D26
  @{ */
#define BOARD_SDRAM_D26_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D26_PIN 13U    /*!<@brief PORTC pin index: 13 */
                                   /* @} */

/*! @name PORTC12 (coord B9), U13[C2]/SDRAM_D27
  @{ */
#define BOARD_SDRAM_D27_PORT PORTC /*!<@brief PORT device name: PORTC */
#define BOARD_SDRAM_D27_PIN 12U    /*!<@brief PORTC pin index: 12 */
                                   /* @} */

/*! @name PORTB23 (coord C12), U13[C1]/SDRAM_D28
  @{ */
#define BOARD_SDRAM_D28_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D28_PIN 23U    /*!<@brief PORTB pin index: 23 */
                                   /* @} */

/*! @name PORTB22 (coord C13), U13[B2]/SDRAM_D29
  @{ */
#define BOARD_SDRAM_D29_PORT PORTB /*!<@brief PORT device name: PORTB */
#define BOARD_SDRAM_D29_PIN 22U    /*!<@brief PORTB pin index: 22 */
                                   /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitSDRAMPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
